export let a = { a: '', b: 1 };
// 非定义时的赋值，属性必须一个不多一个不少
/*
  a = {
    a: '',
    b: 1,
    c: 1,
};
*/
/*
  a = { a: 1 };
*/
/*
  export let a1: A = { a: '', b: 1, c: '' };
  export let a2: A = { a: '' };
*/
let a3 = {
    a: '',
};
let a4 = {
    a: '',
    b: 1,
    c: '',
};
// export let a5: A = a3;
export let a6 = a4;
export let a7 = {
    a: '',
    b: 0,
};
a7 = a4;
// a7 = a3;
/**
 * 结论：
 * 如果是变量赋值给变量，无论是在定义的时候赋值，还是在非定义的时候赋值，可以多出属性，不能少属性
 * 如果是字面量的赋值形式，那么无论是定义的时候赋值，还是在非定义的时候赋值，一个属性都不能多也不能少
 */
