function test() {
    console.log('--- 内置工具类型进阶：类型编程的进阶 ---------------------------------------------');
    test1();
}
/**
 * 属性修饰进阶
 *
 * 深层的属性修饰
 * 基于已知属性的部分修饰，以及基于属性类型的部分修饰
 */
function test1() {
    console.log('--- test1 属性修饰进阶 ---------------------------------------------');
    test1_1();
    test1_2();
}
/**
 * 深层次的属性修饰（满足条件时调用自己（递归））
 */
function test1_1() {
    console.log('--- test1_1 深层次的属性修饰 ---------------------------------------------');
}
function test1_2() {
    console.log('--- test1_2 基于已知属性进行部分修饰 ---------------------------------------------');
}
export default test;
